# IFCExtrusionCreationData Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData Constructor
IFCExtrusionCreationData Class See Also
---
The default constructor.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCExtrusionCreationData()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCExtrusionCreationData()
```

# Remarks
All input data will be considered uninitialized.
# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace